//This notice is professors remarks

/*
	
	-if문-
	if(조건문) - 조건문이 참이라면 아래의 실행문으로 넘어간다.
	{
		(실행문)
	}
	else if(조건문) - 위의 조건문이 맞지않을때, 이것의 조건문이 참이라면 아래의 실행문으로 넘어간다.
	{
		(실행문)
	}
	else - 위의 모든 조건문이 참이 아닐때, 아래의 실행문으로 넘어간다. 
	{
		(실행문)
	}
	cf)if문 작성의 갯수는 제한이 없다. else if문은 if문 아래에만 올수있다.

	-switch문-
	if문과 동일, enum(열거형)과 쌍으로 사용한다(가독성을 높여준다).

	-반복문 for-
	for(초기화문, 조건문, 증감문)
	{
		실행문
	}

	-제어문
	break - 해당 루프 탈출
	return - 값을 내뱉고 해당 함수 탈출
	continue - 실행문 생략
	go to - 지정한 지점으로 이동

	-반복문 while
	while(조건문)
	{
		실행문
	}
	조건문이 참일때만 실행문을 실행한다.

*/

